InformationRegisters/ПрикрепленныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВремХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПрикрепленныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаИзменениеУсловийКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаТорговлю</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_КорректировкаДокумента</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Операция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.БП_Оповещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаИзменениеУсловийКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаТорговлю</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_КорректировкаДокумента</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецИмяТЧ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецСтрокаТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрикрепленныеОбъекты/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТекОбъект = ЭтотОбъект;
	КУдалению = Ложь;
	
	//отрабатываем удаление
	Если НЕ ЭтотОбъект.Количество() Тогда
		ТекЗапись = РегистрыСведений.ПрикрепленныеОбъекты.СоздатьНаборЗаписей();
		
		Для каждого Текотбор Из Отбор Цикл
			ТекЗапись.Отбор.Владелец.Установить(Отбор.Владелец.Значение);	
			ТекЗапись.Отбор.Объект.Установить(Отбор.Объект.Значение);	
			ТекЗапись.Отбор.ВладелецИмяТЧ.Установить(Отбор.ВладелецИмяТЧ.Значение);	
			ТекЗапись.Отбор.ВладелецСтрокаТЧ.Установить(Отбор.ВладелецСтрокаТЧ.Значение);	
		КонецЦикла; 
		
		ТекЗапись.Прочитать();
		
		Если ТекЗапись.Количество() Тогда
			ТекОбъект = ТекЗапись;
			КУдалению = Истина;
		КонецЕсли;
		
	КонецЕсли;//конец обработки удаления
	
	
	Для каждого ТекСтрока Из ТекОбъект Цикл
		
		СтруктураПроверки = БПСервер.ПроверкаВозможностиРедактированияФайлаИПрикрепления(ТекСтрока.Объект, ТекСтрока.АдресВремХранилища, ТекСтрока.Владелец);
		
		Если СтруктураПроверки.ТекСписок.НайтиПоЗначению(ТекСтрока.Объект) = Неопределено И СтруктураПроверки.ЕстьЗапись И РегистрыСведений.ПрикрепленныеОбъекты.ПроверитьВладельца(ТекСтрока.Владелец) Тогда
			Отказ = Истина;
			Сообщить("По данному документу " + ТекСтрока.Владелец + " запущен бизнес-процесс, редактирование прикрепленных объектов запрещено!");
		КонецЕсли;
		
		Попытка
			
			Если БПСервер.ПолучитьМассивПользователей(ТекСтрока.Автор) = Неопределено Тогда
				Отказ = Истина;
				Сообщить("Только автор документа может открепить объект!");
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
		
		
	КонецЦикла;
	
КонецПроцедуры
